### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam.aws_iam_group.iam_group will be created
+   resource "aws_iam_group" "iam_group" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "ManagedByTerraform"
+       path      = "/"
+       unique_id = (known after apply)
    }

  # module.iam.aws_iam_group_membership.iam_group_membership will be created
+   resource "aws_iam_group_membership" "iam_group_membership" {
+       group = "ManagedByTerraform"
+       id    = (known after apply)
+       name  = "ManagedByTerraformMembership"
+       users = [
+           "Configuration",
+           "Terraform",
        ]
    }

  # module.iam.aws_iam_user.configuration will be updated in-place
!   resource "aws_iam_user" "configuration" {
+       force_destroy = false
        id            = "Configuration"
        name          = "Configuration"
        tags          = {}
!       tags_all      = {
+           "ManagedByTerraform" = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user.terraform will be updated in-place
!   resource "aws_iam_user" "terraform" {
+       force_destroy = false
        id            = "Terraform"
        name          = "Terraform"
        tags          = {}
!       tags_all      = {
+           "ManagedByTerraform" = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.configuration will be updated in-place
!   resource "aws_s3_bucket" "configuration" {
+       force_destroy               = false
        id                          = "ctrlplusaltplusdefeat-configuration"
        tags                        = {}
!       tags_all                    = {
+           "ManagedByTerraform" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.s3.aws_s3_bucket_policy.configuration_policy will be created
+   resource "aws_s3_bucket_policy" "configuration_policy" {
+       bucket = "ctrlplusaltplusdefeat-configuration"
+       id     = (known after apply)
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           StringNotEquals = {
+                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::ctrlplusaltplusdefeat-configuration/*"
+                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
+                   {
+                       Action    = "s3:PutObject"
+                       Condition = {
+                           Null = {
+                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = "arn:aws:s3:::ctrlplusaltplusdefeat-configuration/*"
+                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
+                   {
+                       Action    = "s3:*"
+                       Condition = {
+                           Bool = {
+                               "aws:SecureTransport" = "false"
                            }
                        }
+                       Effect    = "Deny"
+                       Principal = "*"
+                       Resource  = [
+                           "arn:aws:s3:::ctrlplusaltplusdefeat-configuration",
+                           "arn:aws:s3:::ctrlplusaltplusdefeat-configuration/*",
                        ]
+                       Sid       = "AllowSSLRequestsOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.configuration_encryption must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "configuration_encryption" {
-       expected_bucket_owner = "847934878252" -> null # forces replacement
!       id                    = "ctrlplusaltplusdefeat-configuration,847934878252" -> (known after apply)
        # (1 unchanged attribute hidden)

-       rule {
-           bucket_key_enabled = true -> null

-           apply_server_side_encryption_by_default {
-               sse_algorithm = "AES256" -> null
            }
        }
+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.configuration_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "configuration_versioning" {
-       expected_bucket_owner = "847934878252" -> null # forces replacement
!       id                    = "ctrlplusaltplusdefeat-configuration,847934878252" -> (known after apply)
        # (1 unchanged attribute hidden)

!       versioning_configuration {
+           mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 3 to change, 2 to destroy.
```
</details>